In [2]:
import pandas as pd

## Loading Data

In [3]:
# read data as pandas dataframe

df = pd.read_csv('./data/flavors.csv')

In [4]:
df

          celery  vegetable
0           corn  vegetable
1       cucumber  vegetable
2    horseradish  vegetable
3      vegetable  vegetable
4         potato  vegetable
..           ...        ...
850         wild        NaN
851     wine-lee        NaN
852        winey        NaN
853       yeasty        NaN
854        ylang        NaN

[855 rows x 2 columns]

In [5]:
# confirm type of df

type(df)

pandas.core.frame.DataFrame

In [6]:
# first five rows of df

df.head()

        celery  vegetable
0         corn  vegetable
1     cucumber  vegetable
2  horseradish  vegetable
3    vegetable  vegetable
4       potato  vegetable

In [7]:
# first ten rows of df

df.head(10)

        celery   vegetable
0         corn   vegetable
1     cucumber   vegetable
2  horseradish   vegetable
3    vegetable   vegetable
4       potato   vegetable
5       tomato   vegetable
6      caraway  herbaceous
7        clove  herbaceous
8       fennel  herbaceous
9   herbaceous  herbaceous

In [8]:
# last five rows of df

df.tail()

       celery vegetable
850      wild       NaN
851  wine-lee       NaN
852     winey       NaN
853    yeasty       NaN
854     ylang       NaN

In [10]:
# show dataframe info

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 855 entries, 0 to 854
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   celery     855 non-null    object
 1   vegetable  112 non-null    object
dtypes: object(2)
memory usage: 13.5+ KB